# Задача 1. hackerrank - Python-If-Else

n = int(input())

if n % 2 == 1:
    print('Weird')
elif 2 <= n <=5 and n % 2 == 0:
    print('Not Weird')
elif 6 <= n <= 20 and n % 2 == 0:
    print('Weird')
elif n >= 20 and n % 2 == 0:
    print('Not Weird')

# Задача 2. Проверка для военкомата

h = int(input('Введите рост в сантиметрах: '))
age = int(input('Укажите возраст в годах: '))
kids = int(input('Укажите число детей: '))
learning = input('Учитесь ли Вы в ВУЗе в настоящее время по очной программе обучения?: ')

if h < 150 or 30 < age < 18 or kids > 2 or learning.lower() == 'да':
    print('Вы не подлежите военной обязанности')
else:
    print('Вы должны встать на воинский учет и подлежите призыву на срочную службу')

# Задача 3. Определение знака Зодиака по дате и месяцу

sign_dates = (
    ((20, 3), (19, 4), 'Овен'),
    ((20, 4), (20, 5), 'Телец'),
    ((21, 5), (20, 6), 'Близнецы'),
    ((21, 6), (22, 7), 'Рак'),
    ((23, 7), (22, 8), 'Лев'),
    ((23, 8), (22, 9), 'Дева'),
    ((23, 9), (22, 10), 'Весы'),
    ((23, 10), (21, 11), 'Скорпион'),
    ((22, 11), (21, 12), 'Стрелец'),
    ((22, 12), (19, 1), 'Козерог'),
    ((20, 1), (17, 2), 'Водолей'),
    ((18, 2), (19, 3), 'Рыбы'),
)

month = int(input('Введите месяц: '))
day = int(input('Введите число: '))

for sign in sign_dates:
    if (month == sign[0][1] and day >= sign[0][0]) or (month == sign[1][1] and day <= sign[1][0]):
        print(sign[2])


